# 3) Descriptive Statistics - Measures of Central Tendency and variability
Perform the following operations on any open source dataset (e.g., data.csv)
1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a dataset (age, income etc.) with numeric variables grouped by one of the qualitative
(categorical) variable. For example, if your categorical variable is age groups and quantitative
variable is income, then provide summary statistics of income grouped by the age groups.
Create a list that contains a numeric value for each response to the categorical variable.
2. Write a Python program to display some basic statistical details like percentile, mean,
standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris-versicolor’ of
iris.csv dataset.
Provide the codes with outputs and explain everything that you do in this step.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('income.csv')

In [3]:
data

        Name  Age  Income
0        Rob   27   70000
1    Michael   29   90000
2      Mohan   29   61000
3     Ismail   28   60000
4       Kory   42  150000
5     Gautam   39  155000
6      David   41  160000
7     Andrea   38  162000
8       Brad   36  156000
9   Angelina   35  130000
10    Donald   37  137000
11       Tom   26   45000
12    Arnold   27   48000
13     Jared   28   51000
14     Stark   29   49500
15    Ranbir   32   53000
16    Dipika   40   65000
17  Priyanka   41   63000
18      Nick   43   64000
19      Alia   39   80000
20       Sid   41   82000
21     Abdul   39   58000

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    22 non-null     object
 1   Age     22 non-null     int64
 2   Income  22 non-null     int64
dtypes: int64(2), object(1)
memory usage: 660.0+ bytes

In [5]:
data.describe()

             Age         Income
count  22.000000      22.000000
mean   34.818182   90431.818182
std     5.901060   43505.964412
min    26.000000   45000.000000
25%    29.000000   58500.000000
50%    36.500000   67500.000000
75%    39.750000  135250.000000
max    43.000000  162000.000000

In [6]:
data.columns

Index(['Name', 'Age', 'Income'], dtype='object')

In [7]:
data.head(10)

       Name  Age  Income
0       Rob   27   70000
1   Michael   29   90000
2     Mohan   29   61000
3    Ismail   28   60000
4      Kory   42  150000
5    Gautam   39  155000
6     David   41  160000
7    Andrea   38  162000
8      Brad   36  156000
9  Angelina   35  130000

In [8]:
data.tail(10)

        Name  Age  Income
12    Arnold   27   48000
13     Jared   28   51000
14     Stark   29   49500
15    Ranbir   32   53000
16    Dipika   40   65000
17  Priyanka   41   63000
18      Nick   43   64000
19      Alia   39   80000
20       Sid   41   82000
21     Abdul   39   58000

In [9]:
data.isnull().sum()

Name      0
Age       0
Income    0
dtype: int64

# statistical details

Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a dataset (age, income etc.) with numeric variables grouped by one of the qualitative (categorical) variable. For example, if your categorical variable is age groups and quantitative variable is income, then provide summary statistics of income grouped by the age groups. Create a list that contains a numeric value for each response to the categorical variable.

1.Age

In [26]:
np.var(data['Age'])

33.23966942148761

In [10]:
np.mean(data['Age'])

34.81818181818182

In [11]:
np.median(data['Age'])

36.5

In [12]:
np.min(data['Age'])

26

In [13]:
np.max(data['Age'])

43

In [14]:
np.std(data['Age'])

5.7653854529847015

# statistical details
2.Income

In [25]:
np.var(data['Income'])

1806733987.6033058

In [15]:
np.mean(data['Income'])

90431.81818181818

In [16]:
np.median(data['Income'])

67500.0

In [17]:
np.min(data['Income'])

45000

In [18]:
np.max(data['Income'])

162000

In [19]:
np.std(data['Income'])

42505.69359042746

# statistical details
3.by group

In [20]:
categorical_variable = 'Age'  
quantitative_variable  = 'Income'         
summary_stats = data.groupby(categorical_variable)[quantitative_variable].describe()

In [21]:
print(summary_stats.head(5))

     count          mean           std      min      25%      50%      75%  \
Age
26     1.0  45000.000000           NaN  45000.0  45000.0  45000.0  45000.0
27     2.0  59000.000000  15556.349186  48000.0  53500.0  59000.0  64500.0
28     2.0  55500.000000   6363.961031  51000.0  53250.0  55500.0  57750.0
29     3.0  66833.333333  20870.633276  49500.0  55250.0  61000.0  75500.0
32     1.0  53000.000000           NaN  53000.0  53000.0  53000.0  53000.0

         max
Age
26   45000.0
27   70000.0
28   60000.0
29   90000.0
32   53000.0

In [22]:
print(summary_stats.head(5).sum())

count         9.000000
mean     279333.333333
std       42790.943493
min      246500.000000
25%      260000.000000
50%      273500.000000
75%      295750.000000
max      318000.000000
dtype: float64

# statistical details

Write a Python program to display some basic statistical details like percentile, mean, standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris-versicolor’ of iris.csv dataset. Provide the codes with outputs and explain everything that you do in this step.

In [23]:
iris_data = pd.read_csv('iris.csv')

filtered_data = iris_data[iris_data['Species'].isin(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'])]

species_stats = filtered_data.groupby('Species').describe()

species_stats

                   Id                                                        \
                count   mean       std    min     25%    50%     75%    max
Species
Iris-setosa      50.0   25.5  14.57738    1.0   13.25   25.5   37.75   50.0
Iris-versicolor  50.0   75.5  14.57738   51.0   63.25   75.5   87.75  100.0
Iris-virginica   50.0  125.5  14.57738  101.0  113.25  125.5  137.75  150.0

                SepalLengthCm         ... PetalLengthCm      PetalWidthCm  \
                        count   mean  ...           75%  max        count
Species                               ...
Iris-setosa              50.0  5.006  ...         1.575  1.9         50.0
Iris-versicolor          50.0  5.936  ...         4.600  5.1         50.0
Iris-virginica           50.0  6.588  ...         5.875  6.9         50.0


                  mean       std  min  25%  50%  75%  max
Species
Iris-setosa      0.244  0.107210  0.1  0.2  0.2  0.3  0.6
Iris-versicolor  1.326  0.197753  1.0  1.2  1.3  1.5  1.8
Iris-virginica   2.026  0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 40 columns]

In [24]:
print(species_stats)

                   Id                                                        \
                count   mean       std    min     25%    50%     75%    max
Species
Iris-setosa      50.0   25.5  14.57738    1.0   13.25   25.5   37.75   50.0
Iris-versicolor  50.0   75.5  14.57738   51.0   63.25   75.5   87.75  100.0
Iris-virginica   50.0  125.5  14.57738  101.0  113.25  125.5  137.75  150.0

                SepalLengthCm         ... PetalLengthCm      PetalWidthCm  \
                        count   mean  ...           75%  max        count
Species                               ...
Iris-setosa              50.0  5.006  ...         1.575  1.9         50.0
Iris-versicolor          50.0  5.936  ...         4.600  5.1         50.0
Iris-virginica           50.0  6.588  ...         5.875  6.9         50.0


                  mean       std  min  25%  50%  75%  max
Species
Iris-setosa      0.244  0.107210  0.1  0.2  0.2  0.3  0.6
Iris-versicolor  1.326  0.197753  1.0  1.2  1.3  1.5  1.8
Iris-virginica   2.026  0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 40 columns]